allergens/app/controllers/ingredients_controller.rb

    def index
        @ingredients=Ingredient.all
---
SELECT "ingredients".* FROM "ingredients"

    def show
        @ingredient=Ingredient.find(params[:id])
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]