allergens/app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        @recipes=Recipe.all

SELECT "users".* FROM "users"
---
    def new
     @users=User.all

INSERT INTO "recipes" ("name", "user_id") VALUES (?, ?)  [["name", "Mel"], ["user_id", 8]]
---
    def create
    @recipe=Recipe.create(name:params[:name],user_id:params[:user_id])